Rahix/avr-device/svd/atmega4809.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>&lt;TBD></description>
      <baseAddress>0x34</baseAddress>
      <registers>
        <register>
          <name>CCP</name>
          <description>Configuration Change Protection</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CCP</name>
              <description>CCP signature</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPM</name>
                  <description>SPM Instruction Protection</description>
                  <value>157</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOREG</name>
                  <description>IO Register Protection</description>
                  <value>216</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPH</name>
          <description>Stack Pointer High</description>
          <addressOffset>0xA</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SPL</name>
          <description>Stack Pointer Low</description>
          <addressOffset>0x9</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
      <interrupt>
        <name>NMI</name>
        <value>1</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>VLM</name>
        <value>2</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>CNT</name>
        <value>3</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>PIT</name>
        <value>4</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>CCL</name>
        <value>5</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>LUNF</name>
        <value>7</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>OVF</name>
        <value>7</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>HUNF</name>
        <value>8</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>9</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>LCMP0</name>
        <value>9</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>CMP1</name>
        <value>10</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>LCMP1</name>
        <value>10</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>CMP2</name>
        <value>11</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>LCMP2</name>
        <value>11</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>TWIS</name>
        <value>14</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>TWIM</name>
        <value>15</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>AC</name>
        <value>21</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>RESRDY</name>
        <value>22</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>WCOMP</name>
        <value>23</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>EE</name>
        <value>30</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>PORT</name>
        <value>35</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>INT</name>
        <value>36</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>RXC</name>
        <value>37</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>DRE</name>
        <value>38</value>
        <description>&lt;TBD></description>
      </interrupt>
      <interrupt>
        <name>TXC</name>
        <value>39</value>
        <description>&lt;TBD></description>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CPUINT</name>
      <description>&lt;TBD></description>
      <baseAddress>0x110</baseAddress>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LVL0RR</name>
              <description>Round-robin Scheduling Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CVT</name>
              <description>Compact Vector Table</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LVL0PRI</name>
          <description>Interrupt Level 0 Priority</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>LVL0PRI</name>
              <description>Interrupt Level Priority</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LVL1VEC</name>
          <description>Interrupt Level 1 Priority Vector</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>LVL1VEC</name>
              <description>Interrupt Vector with High Priority</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>LVL0EX</name>
              <description>Level 0 Interrupt Executing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LVL1EX</name>
              <description>Level 1 Interrupt Executing</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NMIEX</name>
              <description>Non-maskable Interrupt Executing</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
