Rahix/avr-device/svd/atmega4809.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRCSCAN</name>
      <description>&lt;TBD></description>
      <baseAddress>0x120</baseAddress>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable CRC scan</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NMIEN</name>
              <description>Enable NMI Trigger</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset CRC scan</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>SRC</name>
              <description>CRC Source</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>CRC on entire flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APPLICATION</name>
                  <description>CRC on boot and appl section of flash</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>CRC on boot section of flash</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>BUSY</name>
              <description>CRC Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OK</name>
              <description>CRC Ok</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EVSYS</name>
      <description>&lt;TBD></description>
      <baseAddress>0x180</baseAddress>
      <registers>
        <register>
          <name>CHANNEL0</name>
          <description>Multiplexer Channel 0</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>GENERATOR</name>
              <description>Generator selector</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>Unified Program and Debug Interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT0</name>
                  <description>Periodic Interrupt Timer output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT1</name>
                  <description>Periodic Interrupt Timer output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT2</name>
                  <description>Periodic Interrupt Timer output 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT3</name>
                  <description>Periodic Interrupt Timer output 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RESRDY</name>
                  <description>ADC 0 Result Ready Event</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN0</name>
                  <description>Port 0 Pin 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN1</name>
                  <description>Port 0 Pin 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN2</name>
                  <description>Port 0 Pin 2</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN3</name>
                  <description>Port 0 Pin 3</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN4</name>
                  <description>Port 0 Pin 4</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN5</name>
                  <description>Port 0 Pin 5</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN6</name>
                  <description>Port 0 Pin 6</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN7</name>
                  <description>Port 0 Pin 7</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN0</name>
                  <description>Port 1 Pin 0</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN1</name>
                  <description>Port 1 Pin 1</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN2</name>
                  <description>Port 1 Pin 2</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN3</name>
                  <description>Port 1 Pin 3</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN4</name>
                  <description>Port 1 Pin 4</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN5</name>
                  <description>Port 1 Pin 5</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN6</name>
                  <description>Port 1 Pin 6</description>
                  <value>78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN7</name>
                  <description>Port 1 Pin 7</description>
                  <value>79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 Xclock</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 Xclock</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_XCK</name>
                  <description>USART 2 Xclock</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3_XCK</name>
                  <description>USART 3 Xclock</description>
                  <value>99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 Sclock</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte underflow (split mode)</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0</name>
                  <description>Timer/Counter A0 compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1</name>
                  <description>Timer/Counter A0 compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2</name>
                  <description>Timer/Counter A0 compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_CAPT</name>
                  <description>Timer/Counter B2 capture</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_CAPT</name>
                  <description>Timer/Counter B3 capture</description>
                  <value>166</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL1</name>
          <description>Multiplexer Channel 1</description>
          <addressOffset>0x11</addressOffset>
          <fields>
            <field>
              <name>GENERATOR</name>
              <description>Generator selector</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>Unified Program and Debug Interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT0</name>
                  <description>Periodic Interrupt Timer output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT1</name>
                  <description>Periodic Interrupt Timer output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT2</name>
                  <description>Periodic Interrupt Timer output 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT3</name>
                  <description>Periodic Interrupt Timer output 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RESRDY</name>
                  <description>ADC 0 Result Ready Event</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN0</name>
                  <description>Port 0 Pin 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN1</name>
                  <description>Port 0 Pin 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN2</name>
                  <description>Port 0 Pin 2</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN3</name>
                  <description>Port 0 Pin 3</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN4</name>
                  <description>Port 0 Pin 4</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN5</name>
                  <description>Port 0 Pin 5</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN6</name>
                  <description>Port 0 Pin 6</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT0_PIN7</name>
                  <description>Port 0 Pin 7</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN0</name>
                  <description>Port 1 Pin 0</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN1</name>
                  <description>Port 1 Pin 1</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN2</name>
                  <description>Port 1 Pin 2</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN3</name>
                  <description>Port 1 Pin 3</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN4</name>
                  <description>Port 1 Pin 4</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN5</name>
                  <description>Port 1 Pin 5</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN6</name>
                  <description>Port 1 Pin 6</description>
                  <value>78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT1_PIN7</name>
                  <description>Port 1 Pin 7</description>
                  <value>79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 Xclock</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 Xclock</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_XCK</name>
                  <description>USART 2 Xclock</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3_XCK</name>
                  <description>USART 3 Xclock</description>
                  <value>99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 Sclock</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte underflow (split mode)</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0</name>
                  <description>Timer/Counter A0 compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1</name>
                  <description>Timer/Counter A0 compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2</name>
                  <description>Timer/Counter A0 compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_CAPT</name>
                  <description>Timer/Counter B2 capture</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_CAPT</name>
                  <description>Timer/Counter B3 capture</description>
                  <value>166</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
