Rahix/avr-device/svd/atmega4809.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTMUX</name>
      <description>&lt;TBD></description>
      <baseAddress>0x5E0</baseAddress>
      <registers>
        <register>
          <name>CCLROUTEA</name>
          <description>Port Multiplexer CCL</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>LUT0</name>
              <description>CCL LUT0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LUT1</name>
              <description>CCL LUT1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LUT2</name>
              <description>CCL LUT2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LUT3</name>
              <description>CCL LUT3</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSYSROUTEA</name>
          <description>Port Multiplexer EVSYS</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EVOUT0</name>
              <description>Event Output 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EVOUT1</name>
              <description>Event Output 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EVOUT2</name>
              <description>Event Output 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EVOUT3</name>
              <description>Event Output 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EVOUT4</name>
              <description>Event Output 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVOUT5</name>
              <description>Event Output 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCAROUTEA</name>
          <description>Port Multiplexer TCA</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>TCA0</name>
              <description>Port Multiplexer TCA0</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>TCA0 pins on PA[5:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>TCA0 pins on PB[5:0]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>TCA0 pins on PC[5:0]</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>TCA0 pins on PD[5:0]</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE</name>
                  <description>TCA0 pins on PE[5:0]</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF</name>
                  <description>TCA0 pins on PF[5:0]</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCBROUTEA</name>
          <description>Port Multiplexer TCB</description>
          <addressOffset>0x5</addressOffset>
          <fields>
            <field>
              <name>TCB0</name>
              <description>Port Multiplexer TCB0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCB1</name>
              <description>Port Multiplexer TCB1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TCB2</name>
              <description>Port Multiplexer TCB2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCB3</name>
              <description>Port Multiplexer TCB3</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TWISPIROUTEA</name>
          <description>Port Multiplexer TWI and SPI</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>SPI0</name>
              <description>Port Multiplexer SPI0</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>SPI0 on PA[7:4]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>SPI0 on PC[3:0]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>SPI0 on PE[3:0]</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWI0</name>
              <description>Port Multiplexer TWI0</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>SCL/SDA on PA[3:2], Slave mode on PC[3:2] in dual TWI mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>SCL/SDA on PA[3:2], Slave mode on PF[3:2] in dual TWI mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>SCL/SDA on PC[3:2], Slave mode on PF[3:2] in dual TWI mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USARTROUTEA</name>
          <description>Port Multiplexer USART register A</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>USART0</name>
              <description>Port Multiplexer USART0</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART0 on PA[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART0 on PA[7:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART1</name>
              <description>Port Multiplexer USART1</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART1 on PC[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART1 on PC[7:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART2</name>
              <description>Port Multiplexer USART2</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART2 on PF[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART2 on PF[6:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART3</name>
              <description>Port Multiplexer USART3</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART3 on PB[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART3 on PB[5:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
