Rahix/avr-device/svd/atmega4809.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>&lt;TBD></description>
      <baseAddress>0xF01</baseAddress>
      <registers>
        <register>
          <name>EXTBRK</name>
          <description>External Break</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>ENEXTBRK</name>
              <description>External break enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OCDM</name>
          <description>OCD Message Register</description>
          <addressOffset>0x17</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCDMS</name>
          <description>OCD Message Status</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>OCDMR</name>
              <description>OCD Message Read</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REVID</name>
          <description>Revision ID</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TCB0</name>
      <description>&lt;TBD></description>
      <baseAddress>0xA80</baseAddress>
      <registers>
        <register>
          <name>CCMP</name>
          <description>Compare or Capture</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CNT</name>
          <description>Count</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitRange>[2:1]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKDIV1</name>
                  <description>CLK_PER (No Prescaling)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV2</name>
                  <description>CLK_PER/2 (From Prescaler)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKTCA</name>
                  <description>Use Clock from TCA</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCUPD</name>
              <description>Synchronize Update</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run Standby</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control Register B</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>CNTMODE</name>
              <description>Timer Mode</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Periodic Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMEOUT</name>
                  <description>Periodic Timeout</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <description>Input Capture Event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ</name>
                  <description>Input Capture Frequency measurement</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PW</name>
                  <description>Input Capture Pulse-Width measurement</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQPW</name>
                  <description>Input Capture Frequency and Pulse-Width measurement</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single Shot</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM8</name>
                  <description>8-bit PWM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCMPEN</name>
              <description>Pin Output Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CCMPINIT</name>
              <description>Pin Initial State</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ASYNC</name>
              <description>Asynchronous Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CAPTEI</name>
              <description>Event Input Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EDGE</name>
              <description>Event Edge</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FILTER</name>
              <description>Input Capture Noise Cancellation Filter</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0x5</addressOffset>
          <fields>
            <field>
              <name>CAPT</name>
              <description>Capture or Timeout</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>CAPT</name>
              <description>Capture or Timeout</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x7</addressOffset>
          <fields>
            <field>
              <name>RUN</name>
              <description>Run</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary Value</description>
          <addressOffset>0x9</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
